mass/backend/controllers/GoodsController.php

SELECT * FROM `goods_cate` WHERE `id`='23'
---
    public function actionViewCate($id)
    {
        $model=GoodsCate::findOne($id);

SELECT * FROM `goods` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Goods::findOne($id)) !== null) {