mass/backend/controllers/NewsController.php

SELECT * FROM `news_cate`
---
    public function actionNews()
    {

        $searchModel = new SearchNews();
       // $searchModel->cateid=$cateid;
        $cate=NewsCate::find()->all();