mass/api/controllers/GoodsController.php

   public function actionSubmitComment(){
       $user=yii::$app->user->identity;
       $data=$_POST['data'];
       $orderid=$data['orderid'];
       $content=$data['content'];
       //$score=$data['score'];

       $order=Orders::findOne(['id'=>$orderid]);
---
SELECT * FROM `orders` WHERE `id`=2

   public function getAlipayOrder($orderid,$orderType){
       $order=Orders::findOne($orderid);
---
SELECT * FROM `orders` WHERE `id`=2