mass/api/controllers/NewsController.php

    public function actionIndex()
    {
        $cateid=1;
        if(isset($_GET['cateid'])){
            $cateid=$_GET['cateid'];
        }
        $cate=NewsCate::findOne($cateid);
        $model=News::find()->andWhere(['is_recommend'=>1,'cateid'=>$cateid])->orderBy('created_at desc')->limit(8)->all();
---
SELECT * FROM `news_cate` WHERE `cateid`=1
SELECT * FROM `news` WHERE (`is_recommend`=1) AND (`cateid`=1) ORDER BY `created_at` DESC LIMIT 8

    public function actionView($id)
    {
        $model=$this->findModel($id);
        $model->count_view+=1;
        $model->save();
        $title=$model->title;
        $relativeNews=News::find()->andWhere(['cateid'=>1])->limit(10)->orderBy('created_at desc ')->all();
        $comment=CommentNew::find()->andWhere(['newsid'=>$id])->orderBy('created_at desc')->all();
---
SELECT * FROM `news` WHERE `cateid`=1 ORDER BY `created_at` DESC LIMIT 10
SELECT * FROM `comment_new` WHERE `newsid`='4' ORDER BY `created_at` DESC

    public function actionSubmitComment(){
        $content=$_POST['content'];
        if(empty($content)){
            yii::$app->getSession()->setFlash('error','请填写评论内容!');
            return $this->redirect(yii::$app->request->referrer);
        }
        $comment=new CommentNew();
        $comment->user_guid=@$_GET['user_guid'];
        $comment->newsid=@$_POST['newsid'];
        $comment->content=$content;
        $comment->created_at=time();
        if($comment->save()){
---
INSERT INTO `comment_new` (`user_guid`, `newsid`, `content`, `created_at`) VALUES (NULL, 4, '   \r\n   samdjhaksjdkaDSJHamsdbjhaSDJahsbdjaHSDJAHds期请问请问据不赞成把是可敬的巴适得板按时间段吧阿萨德叫阿北师大版阿萨德空白阿萨德按时间段吧阿萨德看见爱上大叔控得加班阿萨德科技阿萨德科技把收到阿萨德吧阿萨德吧卡金山毒霸阿萨德科技阿萨德科技吧爱是看得见吧奥斯卡级的吧阿萨德阿克苏九点半阿萨德', '1492789833')

    protected function findModel($id)
    {
        if (($model = News::findOne($id)) !== null) {
---
SELECT * FROM `news` WHERE `newsid`='4'