mass/api/controllers/SiteController.php

    public function actionGetLoveinfo(){
        $cateid=1;
        if(isset($_GET['access-token'])){
            $user=User::findOne(['access_token'=>$_GET['access-token']]);
            $visitCate=UserVisit::findOne(['user_guid'=>$user->user_guid]);
            if(!empty($visitCate)){
                $cateid=$visitCate->id;
            }
        }
        $loveCate=GoodsCate::findOne($cateid);
        $goods=Goods::find()->andWhere(['cateid'=>$cateid])->orderBy('created_at desc')->limit(10)->all();
---
SELECT * FROM `goods_cate` WHERE `id`=1
SELECT * FROM `goods` WHERE `cateid`=1 ORDER BY `created_at` DESC LIMIT 10